<template>
    <div style="">
        <el-container style=" border: 1px solid #eee;     height: 85vh;
">
            <el-aside width="300px" style= " border : 1px solid #eee">
                <el-menu v-for="(chapter, index) in subjects[$route.params.id - 1].chapters" v-bind:key="index" style = "border : 0px; ">
                    <el-menu-item-group  @click.native="changeNumber(index)">
                        <el-menu-item style= "border-bottom : 1px solid #eee">{{ chapter }}</el-menu-item>
                    </el-menu-item-group>
                </el-menu>
            </el-aside>

            <el-container>

                <el-main>
                    <h1>
                        {{ subjects[ $route.params.id - 1 ].title}}
                    </h1>
                    <h2>
                        {{ subjects[ $route.params.id - 1 ].chapters[chapterNumber]}}
                    </h2>

                    <span style="white-space: pre-wrap; 
  font-family: inherit;">
                        {{ subjects[ $route.params.id - 1 ].contents[chapterNumber]}}
                    </span>
                </el-main>
            </el-container>
        </el-container>

    </div>
</template>

<script>
    export default {
        methods: {
            changeNumber: function(a) {
                this.chapterNumber = a;
            }
        },
        data: function() {
            return {
                chapterNumber: 0,
                subjects: [{
                        title: '구급법',
                        chapters: ['개요', '우선순위에 따른 행동', '가벼운 부상을 입은 환자의 구급법', '붕대 감는 법', '부상자 옮기기'],
                        contents: [`문서 서술에 앞서 가장 중요한 내용, 모든 경우의 일차적 대응 방안은 신고다. 한국의 경우 119를 통해, 미국의 경우는 911을 통해 응급의료신고가 가능하다. 일반인의 경우 환자의 상황을 정확히 파악하기 힘들고, 상태에 따른 적절한 의약품을 사용하기는 불가능에 가깝다. 일례로, 웬만한 사람들은 아나필락시스 쇼크[1]에 쓰이는 에피네프린 제제를 보유하고 있지는 않을 것이다. 그러니 응급 상황 발생시에는 일단 신고 후 응급처치를 하자.

구급법(救急法)은 사람을 급(急)히 구(救)하는 법(法)을 말하며 응급조치를 하는 일체의 모든 의료행위를 말한다. 물에 빠진 사람 등을 구조하는 방법에 대해서는 인명구조 항목을 참고하면 된다. 구급법은 국방부 퀘스트 수행자라면 부상당한 전우에게 시행할 수 있는 응급조치를 배우게 된다. 크게 심폐소생술, 인공호흡, 부축법[2], 지혈법[3] 등을 배우게 된다. 당연히 군에서 가르치는 것은 전문적인 수준으로 교육시키는 것은 아니고 어디까지나 전투현장에서 부상당한 전우에게 '응급조치'를 해줄 수 있는 정도를 기준으로 잡고 교육시키는게 보통이다. 주변에서 들려오는 고통의 소리

왜냐하면 부상병이 발생했을 경우 초기에 적절하게 조치를 해주는 것만으로도 병사의 생존 확률이 크게 높아지기 때문. 사실 이런 구급법이나 의무병이 실시하는 치료 등은 확실하게 그 자리에서 다친 사람을 낫게하는 게 아니다. 나폴레옹 당시 넙다리뼈 (대퇴골) 골절을 일으킨 부상자에게 부목을 대주고 후방으로 이송시킨 것만으로도 사망자의 수가 대폭 감소했다는 말도 있을만큼 바로 부상 병력이 후방으로 후송되어 안전하고 전문적으로 치료받을 수 있도록버틸 수 있게 조치하는 것이다. 물론 다시 싸울 수 있으면 투입.

실습 자체도 다른 훈련과 달리 그다지 준비할 것도 없고 관련 교범과 치료에 필요한 장비만 있으면 된다. 야전에서 간단하고 효과적으로 쓸 수 있는 것이어야 하기 때문에 여타 다른 훈련에 필요한 장비들보다 저렴하고 간편하게 마련하는 것이 가능하다. 붕대, 부목 정도이며 환자 역할을 할 사람을 정하고 부상 상황을 준 후 대응 방법을 살펴보면 되는 간단한 것이기 때문에 자주 경험하게 된다.

몇몇 교관들은 심폐소생술 배워서 전역하고도 쓸 수 있다고 하는데 우스갯소리로 듣지 마라. 자격증이 없는 사람이 무리하게 시도했다가 갈비뼈가 부러지는 경우가 있지만 안 하는 것보다 훨씬 낫다. 숙달된 심폐소생술이 아니라면 압박 위치나 방법이 안 좋아 갈비뼈만 부러뜨리고 효과는 없는 경우도 있지만 자신이 할 줄 모른다고 멍하니 쳐다보는 것보다 미숙하더라도 심폐소생술을 하는 것이 응급 구조가 필요한 환자를 살릴 확률이 매우 높아진다. 숙달되지 않았다면 119에 영상 통화를 이용해 구조대원에게 상황을 보여주면서 구조대원의 지시에 맞게 심폐소생술을 시도하는 것이 좋다. 응급처치에 대해서는 전문적으로 가르치는 곳이 그리 많지는 않지만, 각급 학교나 소방서, 대한적십자사에서 자체적으로 교육하는 프로그램이 종종 있다. 위에서 말했듯 군에서 가르치는 것도 사회의 가이드 라인은 못 따라가지만 아무 것도 안 하는 것보다 훨씬 좋다.

아래의 설명은 주로 겪기 쉬운 사항에 대한 간략하고, 실용적인 내용을 담았다. 잘못된 지식이나 반달로 인한 잘못된 처치가 기록 되었을 수 있다. 이 문서는 특성상 사람의 생사를 가를 수 있는 지식을 다룬다. 작은 차이로 큰 문제가 생길 수 있으니 조금이라도 의심가거나 의문이 생긴다면 주저없이 타 매체나 전문가에게 물어 보충하는 등 타문서보다 깊은 주의를 바란다. 또한 이 문서의 내용을 맹신하면 곤란하다. 위키백과 문서가 그렇듯이 의학적인 정보는 전문적인 수준이 아니며, 그저 재미로 보거나 '이런 방법이 있구나' 정도로 생각하는 게 좋다. 진짜로 응급상황을 대비하기 위해선 구급법에 대한 검증된 서적, TV 방송 등을 통해 지식을 습득하는 것이 중요하다. 각종 구급법과 주의사항이 많으니 참고하길 바란다.국민재난안전포털 생활안전행동요령`, `후술되듯 위험상황에서 벗어나는 것이 최우선이다. 하지만 구급법을 시행하기 이전에 휴대전화가 멀리 있는 등 응급 구조를 할 수 있는 상황이 아니라면 가장 우선시되는 행동은 119에 직접 연락하거나, 근처의 사람을 직접 지목하여 119에 연락해줄 것을 요청하는 것이다. 그 다음에 구급행위를 한다.

이런 예외 상황을 제외하고 첫번째로 해야 할 것은, '위험상황에서 벗어나야 한다.' 부상자와 함께 안전한 장소로 옮겨 위기에서 벗어나야 한다. 전기가 통하는 곳이라면 환자를 함부로 만져서는 안 되고, 일단 전기가 통하지 않는 마른 물체 위에 올려놓는다. 독성 가스가 새어나오는 상황이라면 최대한 맑은 공기로 나온다. 사실 부상자를 움직이는 것은 내상의 위험 때문에 매우 조심스러워야 하는 일이다. 그러나 일단 위기상황에서 벗어나야 치료를 하든 사후 처리를 하든 다음 행동을 할 수 있기 때문에, 부상자와 빨리 탈출하는 것이 가장 올바르다. 척추에 부상을 입은 환자는 많은 사람이 필요하기 때문에, 만약 옮기는 사람이 개인이라면 최대한 옮기는 것을 피하고 사람을 불러 오자. 하지만 불이 난 상황이라든가의 정말 위급한 상황일 때는 이것저것 생각하지 말고 부상자를 옮겨라. 생명에 관한 모든 일이 그렇듯, 구급법에 대한 부분은 언제나 유연하지만 냉철한 판단이 요구된다.

환자를 안전한 곳으로 옮겼다면, 두번째는 'ABC'다. 'Airway - 기도, Breathing - 호흡, Circulation - 맥박, Conscious - 의식'을 확인한다. 이 중 확인하는 순서는 거꾸로 이루어진다. 1. 의식을 가장 먼저 확인해야 하고, 2. 손목이나 경동맥을 눌러보아 맥박을 확인하며, 3. 호흡을 확인하고, 4. 기도가 막히지 않았나 확인한다.

그리고 만약 환자가 출혈을 일으키고 있다면 지혈을 해야 한다. 그 다음 할 일은 상처나 화상 부위에 대한 대처이며 그 다음이 골절상에 대한 대처다. 맨 마지막으로 해야 할 일은 환자가 쇼크에서 회복하도록 도와주는 일이다.

그러나, 가장 중요한 일은 '자신의 안전'이다. 치료하기 전에 본인에게 닥칠 위험은 없는지 철저하게 확인해야 한다. 전기줄이 땅에 떨어져 있다면 9m 이내로 가는 것은 매우 위험하다. 가스관이 새고 있는데 밀폐된 공간으로 구하러 들어가는 것은 그냥 자살행위다. 사실 왠만한 상황이라면 앰뷸런스가 달려들 것이고, 구출과 응급처치는 그들에게 맡기는 것이 제일이다. 그러나 그렇지 못할 경우 구급대원이 없고 치료할 수 있는 것은 자신 뿐인 최악의 상태일 때, 일분 일초가 그 사람의 평생을 결정하는 결정적인 순간에 움직일 수 있고, 구급처치의 방법을 아는 것이야 말로 진정 가치있는 일이다. 그럼에도 불구하고 언제나 자신의 안전을 최우선으로 행동하는 것이 남을 돕는 첫번째 행동임을 명심해야 한다.`,
                            `심각하지 않고 사소한 부상이지만, 일상생활에서 걸리적 거리고, 심지어 몸의 저항력이 약해진 환자에게는 치명적일 수 있으며, 구급법이 필요한 정도의 생존상황이라면 작은 질환도 큰 문제로 발전 할 수 있다. 티눈이나 가시박힌 곳을 잘라내면 세균 감염의 위험이 있기 때문에 안된다, 등의 잔 지식이다. 어쩌면 가장 활용도가 높을지도.
물집은 주로 손과 발에 생긴다. 물집을 방지하기 위해서는 장갑을 끼고, 헝겊 따위로 부위를 감아주는 것이 좋다. 신발은 발에 꼭 맞는 것으로 신어야 한다. 신발을 물이나 기름에 넣어 문지르면 부드럽게 되어 신기가 편해진다. 발은 특히 물집이 자주 생기는 곳이다. 주로 물에 젖은 신발로 걷다가 양말이 내려와서 흘러내려 생기는 주름 부위에 물집이 생기기 쉽다. 이럴때는 양말을 신발 위에 묶어두는 것도 좋다. 또한 양말을 두켤레로 준비하되, 겉에는 나일론, 속에는 면 양말을 신는 것도 좋다. 치료하는 방법은 물집이 잡힌 곳을 깨끗하게 씻고, 소독된 바늘로 물집 가장자리를 찔러 수포 속의 물을 빼내야 한다. 그 후로 천으로 덮어 반창고나 붕대로 고정시키는 것이다.
눈꺼풀에 이물질이 들어갔다면 아래로 잡아당겨 안구와 아래쪽 눈꺼풀을 살핀다. 이때, 눈을 위로 치켜떠야 한다. 옷자락 끝이나 깨끗히 씻은 손에 물을 묻혀서 이물질을 제거한다. 윗 눈꺼풀에 들어갔다면 육안으로 확인할 수가 없는데, 이때는 윗 눈꺼풀을 잡아당겨 아랫 눈꺼풀의 눈썹까지 잡아당겨 속눈섭으로 이물질을 쓸어내는 방법이 있다. 다만, 효과가 없을 경우는 거울로 상태를 살펴본다. 옆 사람이 있다면 윗 눈꺼풀을 살펴보게 해야 하는데, 이때는 눈꺼풀을 성냥개비나 연필 등으로 위로 뒤집어 확인하게 한다. 물에 젖은 옷자락, 깨끗한 붓 등으로 사용해 이물질을 제거해야 한다.
귀가 아플 때 감염이 아니라면 보통 이통은 고막에 있는 귀지의 압력으로 생긴다. 이때 귀의 통증이 참을 수 없을 정도로 고통스럽다면, 따듯하게 데운 식용유 몇 방울을 탈지면에 떨어뜨려 놓고, 그걸로 귀를 막아둔다. 열로 통증이 완화되고 기름이 귀지를 부드럽게 만들어줄 것이다. 기름을 넣는 방법은 귓 속에 벌레가 들어갔을 때에도 매우 효과적인 방법이다. 알코올을 넣으면 벌레를 죽일 수 있는 가장 효과적인 방법이지만 벌레가 귓 속에서 발버둥을 치다 상처를 내기 쉽다. 물 또한 마찬가지. 기름을 귓속에 넣으면 기름이 벌레가 발버둥칠 때 날 수 있는 상처를 막아준다. 다만 주의점은 데운 기름을 절대로 귓 속에 절대로 넣지 말 것. 귓 속의 외이도는 굉장히 예민한 부분이라 뜨거운 기름을 그대로 넣어버리면 상처가 더 심해질 수 있다.
충치로 인해 생기거나 때운 충전재가 빠져 신경이 노출되었을 때 발생한다. 이에 생긴 구멍을 막아 신경을 덮어주면 조금 나을 것이다. 치과에 갈 수 없는 상황일 경우 소나무나 여타 끈적끈적한 진액이 나오는 나무의 진액을 탈지면에 받아 이빨의 구멍 위에 발라주면 어느정도 아픔이 덜하다. 사고로 인해 이빨이 빠진 경우는 천을 이빨이 빠져 피가 나오고 있는 부분에 넣고 악 문다. 지혈에 도움이 된다.`,
                            `기본은 단단하게, 풀리지 않도록이다. 상처 부위가 불필요하게 움직이지 않도록 하는 것이 붕대 감기의 목적이므로 일단 단단히 감아 주자. 하지만 혈액 순환을 방해할 정도로 감는 것은 출혈이 없다면 상당히 위험한 행위이다. 적당히 감아주자. 짧은 면이 1m 정도의 삼각 붕대는 유용하게 사용할 수 있지만, 우리가 주로 보는 붕대는 두루마리 휴지처럼 말려 있는 롤 부대와 압박붕대다. 압박붕대는 쉽게 느슨해지지 않고 압력이 균일하게 가해지며 감기가 쉽다. 그러나 어떠한 재료로도 감거나 걸어매는 붕대를 만들 수 있고, 특히 옷은 붕대로 적합하다. 다만, 이런 것들을 붕대로 사용할 때는 필요이상 강하게 매지 않고, 살 속으로 파고들지 않도록 주의해야 한다. 붕대는 풀리지 않을 정도로 단단하게 감아주어야 하나, 혈액 순환을 막을 정도로 강하게 묶어서는 안된다.

붕대를 감을 때는 먼저 사선으로 단단하게 감는다. 그리고 가장자리 선의 평형을 유지하면서 약 30~50cm정도를 남겨주고 둘둘 감는다. 그리고 끝맺음을 할 때에는 마지막 층 아래에 붕대의 끝을 밀어넣고 안전핀, 반창고 등으로 고정시킨다. 아니라면 붕대의 마지막 부분을 두 조각으로 갈라서 양방향으로 돌려 매듭을 만들어 마무리할 수도 있다. 두 개 이상의 붕대를 사용할 때는 매듭으로 연결하는 것이 아니라, 새로운 붕대를 이미 감아놓은 붕대 위에 겹쳐서 감는 것이다. 붕대의 끝맺음으로 매듭을 만든다면 상처를 피해서 되도록 바깥쪽에 눈에 잘 띄도록 감아야 한다. 매듭은 풀기 쉬워야 한다. 붕대를 자주 바꿔줘야 할지도 모르기 때문이다. 붕대가 너무 세지 않는지 수시로 확인해야 한다. 손 끝이나 발끝이 푸르게 변하면 혈액순환에 문제가 생겼다는 것이다. 붕대를 감을 때에는 목, 허리, 가랑이, 무릎 등과 같이 신체부위 중 움푹 파인 곳을 이용해서 붕대를 통과시키면 편하다.
손과 발을 부상당한 경우 손목에서 시작하여 손등 위를 지나 손가락 부분을 하나하나 감아준다. 손가락을 감을 때는 붕대가 손톱 바로 아래를 지나게 한다. 손가락을 감은 후 손바닥을 지나 다시 손목을 감아준다. 손 전체를 모두 감을 때까지 이를 반복하고, 붕대를 고정한다. 발목에서 시작하여 풀리지 않도록 감아준다. 나머지는 손과 같다.
허벅지와 다리에 붕대를 감아야 한다면 아랫쪽에서 시작하여 위쪽으로 감아나간다.
팔꿈치와 무릎 부상느 관절부위에서 시작하여 위쪽으로 감아나간다.
상박과 대퇴부는 8자형으로 붕대를 감는다. 무릎이나 팔꿈치에서 시작한다면 위로 감아나간다.`,
                            `척추나 하반신에 부상을 입은 환자는 가급적 들것에 실어서 옮겨야 한다. 들것은 의외로 간단하게 주변에서 구할 수 있는데, 정 안되면 단단한 가방 두개로 들 수도 있고, 질긴 옷을 몇겹 겹쳐서 사용해도 좋다. 담요를 막대기 두개에 감으면 훌륭한 들것이 된다. 급하면 담요 끝자락을 말아서 손잡이로 사용해도 된다. 다만, 이렇게 급조된 들것은 막상 제대로 작동을 안할 수 있음으로 환자를 싣기 전에 미리 테스트해보는 것이 좋다.
7.1. 들것이 없을 때[편집]
혼자서 하는 방법이 있다. 두명 이상이 옮기는 것이 낫지만, 장거리를 가야 하는 상황이나 어쩔 수 없는 상황에서는 혼자서 한다. 환자를 떨어뜨리거나 하지 않아야 함으로 냉정하게 자신의 힘을 평가해야 한다. 힘이 약하거나, 상대적으로 환자가 무거울 경우 그냥 담요나 코트 위에 올려서 질질 끌고 가자.
7.2. 안아서 옮기기?[편집]
파일:attachment/arms_carry.gif
공주님 안기 문서에서도 볼 수 있지만, 군용 제식 명칭 겸 응급 구급 용어로는 '1인 안기 운송법(Arms carry)'이다. 구조대상자가 구조자보다 체중이 가볍거나 운반 거리가 짧을 때 이용되며 요구조자가 의식이 있을 때엔 팔을 구조자의 목에 둘러 부담을 덜어주도록 한다. 대퇴골까지 석고 한 사람 이동시에도 쓰이기도 한다. 다만 대상이 허리를 굽히지 않은 차렷 자세로 꼿꼿한 상태고 이를 바닥부터 팔 힘과 허리 반동만으로 완전히 들어올려야 해서 매우 어렵기 때문에 의식이 있는 부상자, 의식이 없는 중환자 모두에게 공주님 안기는 자제하는 것이 좋다 체력 소모도 많고, 위험하다. 영화와 현실은 많이 다르다.

파일:attachment/Fireman_carry_Army.jpg

상대적으로 체력에 자신이 있거나, 환자가 가벼운 경우에 시도할 수 있는 방법이 있다. '소방대원식 운송법(Fireman's Carry)' 이라고 하는 소방관들이 사용하는 효과적인 운반법이다. 다만 무거운 환자일 경우 적절치 않다. 우선 환자의 얼굴을 보고 정면에서 얼굴을 보면서 안는 것 처럼 일으켜 세운다. 그 후 왼손으로 환자의 오른손을 들어 올린다. 거울을 볼 때, 오른손을 움직이면 거울 건너편에서는 왼손을 움직이듯이, 왼손으로 환자의 오른손을 들어 올려 목 뒤로 넘긴다. 그 다음 환자의 오른손으로 목을 감쌌다면, 한쪽 무릎을 꿇고 환자의 오른손을 당겨 환자의 복부 부분을 목과 어깨로 받쳐 든다. 오른팔로는 허벅지를 잡는다. 허벅지를 감싼 오른팔로 환자의 반대쪽에 덜렁거리는 오른팔을 잡아 고정하고 일어서면, 비교적 편안하고 안전한 자세로 환자를 옮길 수 있게 된다. 다만 이때 환자의 머리가 아래를 향하고 있기 때문에 머리나 얼굴에 부상을 입었다면 피해야 한다.

'척추를 다친 사람은 움직이게 하지 않는다'가 원칙이지만, 사실 위험하면 옮겨야 한다. 척추를 다친 환자를 옮길 때는 서너명이 옮긴다. 들것은 테이블 등의 구부러지지 않는 들것을 사용하고, 만약 없다면 들것을 구부리거나 휘게 해서는 안된다. 한사람은 환자의 머리와 목의 안정을 유지하는데만 신경을 쓰고, 다른 사람은 어깨를 잡는다. 들것이나 판자가 없다면 담요나 코트에 감아서 옮겨도 좋다. 머리와 상체가 똑바로 유지되게 하여 옮겨야 한다. 여럿이서 할 때도 마찬가지지만, 혼자서 나를 때도 환자를 절대로 뒤집으면 안 된다. 엎드려 있다면 환자의 어깨를 당겨서 옮기고, 위를 보고 누워 있다면 발목을 잡아당겨서 최대한 조심스럽게 옮긴다. 환자의 몸이 휘게 해서는 안된다. 울퉁불퉁한 땅이나 계단을 지날 때에는 머리를 팔 위에 올려놓고 어깨를 당기면서 뒤에서 환자를 끌어야 한다.

파일:httptraining.gnfire.go.krsub.phptxtno=2331.gif

줄을 사용해도 좋다. 혼자서 장거리를 실어 나를 때가장 유용한 방법이다. 우선 긴 밧줄 혹은 벨트 여러 개, 개방용 끈으로 사용되는 합성수지, 가죽등을 사용할 수 있다. 다만 살갗에 파고들지 않게 궁리를 해야 한다. 우선 그러한 끈으로 고리를 만들고, 환자의 몸통 한 가운데 (허리와 엉덩이 부분)를 중심으로 고리를 끼워 넣는다. 그 후 고리의 한쪽 끝에 한쪽 팔을 끼우고, 그대로 환자를 뒤집고 구조자 자신이 환자의 밑으로 들어가고, 나머지 한쪽 고리에 나머지 팔을 끼워 넣는다. 그 후 환자를 고정한 고리를 단단히 당겨서 환자를 고정하고 천천히 일어선다. 즉 환자를 고리로 엉덩이와 등을 고정하여 가방처럼 매는 것이다.

마지막으로 두 명 이상 있을 때는, 옛날에 했던 기마 놀이처럼 손을 맡잡아 인간 의자를 만든 다음 환자를 싣고 운반해도 좋다. 혹은 둘이서라면 얼마든지 다른 방법이 있을 수 있다.`
                        ]
                    }, {
                        title: '군사 영어',
                        chapters: ['개요', '제식 구령', '계급'],
                        contents: [`군사 영어는 군대 생활에 대한 모든 것들을 영어로 표현한 것들을 말한다. 미국 군인들이 항상 사용하는 언어가 많이 들어가 있고, 일부 내용은 군대 생활에 대한 내용도 담겨 있다. 추천 도서는
영국어로 배우는 군사전략·작전·전술(테잎 포함) 김정필 엮음 | 반석출판사 펴냄 이 있다.`,
                            `경례	Present Arms
바로 (경례후)	Order Arms
바로	Ready Front
차렷	(At) Attention
열중쉬어	Parade Rest
쉬어	At Ease
제자리 걸어가	Mark Time March
뛰어가	Doubletime… March
줄줄이 우로 가	Column Right… March
줄줄이 좌로 가	Column Left… March
받들어 총	Present… Arms
세워 총	Order… Arms
우로 봐	Eyes… Right(er)
앞으로 가	Forward… March
우향 앞으로 가	Right Flank… March
좌향 앞으로 가	Left Flank… March
앞으로 가 (분열)	Forward… March
뒤로 돌아가	To the Rear… March
제자리에 서	Platoon(Ready)… Halt
번호 붙여 가	Countoff… Off
빠른 걸음으로 가	Doubletime… March
좌향좌	Left(er)… Face
우향우	Right(er)… Face
뒤로 돌아	About… Face
해산	Dismissed / Fallout`,
                            `훈련병	Private (PVT)
이병	Private Second Class (PV2)
일병	Private First Class (PFC)
상병	Corporal (CPL) / Specialist (SPC) [note 1]
병장	Sergeant (SGT)
하사	Staff Sergeant (SSG)
중사	Sergeant First Class (SFC)
상사	Master Sergeant (MSG)
일등상사	First Sergeant (1SG)
원사	Sergeant Major (SGM)
주임원사	Command Sergeant Major (CSM)
육군총원사	Sergeant Major of the Army (SMA)
준위	Warrant Officer (WO1)
준위장	Chief Warrant Officer (CW2)
준위장	Chief Warrant Officer (CW3)
준위장	Chief Warrant Officer (CW4)
준위장	Chief Warrant Officer (CW5)
소위	Second Lieutenant (2LT)
중위	First Lieutenant (1LT)
대위	Captain (CPT)
소령	Major (MAJ)
중령	Lieutenant Colonel (LTC)
대령	Colonel (COL)
준장	Brigadier General (BG)
소장	Major General (MG)
중장	Lieutenant General (LTG)
대장	General (GEN)
원수	General of the Army (GA)
`
                        ],
                    },
                    {
                        title: '군부대',
                        chapters: ['직할', '지상작전사령부', '제2작전사령부'],
                        contents: [`수도방위사령부 "방패"
제52향토보병사단 "화살"
제56향토보병사단 "북한산"
군수지원단
헌병단
제3헌병대대
제5헌병대대
제7헌병대
제33헌병대
특별경호대(특수임무대)
방패교육대
제1방공여단
제1경비단
제122정보통신단
제1113공병단
제35특공대대
특수전사령부 "사자"
제1공수특전여단 "독수리"
제3공수특전여단 "비호"
제7공수특전여단 "천마"
제9공수특전여단 "귀성"
제11공수특전여단 "황금박쥐"
제13특수임무여단 "흑표"
국제평화지원단 "온누리"
레바논평화유지단 "동명"
아프가니스탄재건지원단 "오쉬노"
아랍에미리트군사훈련협력단 "아크"
남수단재건지원단 "한빛"
필리핀합동지원단 "아라우"
특수전학교
제707특수임무단 "백호"
미사일사령부 "무극"
항공작전사령부 "불사조"
제1항공여단
제2항공여단
군수사령부 "칠성대"
종합정비창
종합보급창
탄약지원사령부
교육사령부 "창조대"
육군훈련소
기계화학교 / 교육여단
보병학교 / 교육여단
포병학교 / 교육여단
방공학교
공병학교
정보학교
정보통신학교
항공학교
화생방학교
종합행정학교
과학화전투훈련단
전투발전단
학생군사학교
육군부사관학교
동원전력사령부
제60동원보병사단 "권율"
제72동원보병사단 "올림픽"
제66동원보병사단 "횃불"
제75동원보병사단 "철마"
제31향토보병사단 동원지원단
제32향토보병사단 동원지원단
제35향토보병사단 동원지원단
제36향토보병사단 동원지원단
제37향토보병사단 동원지원단
제39향토보병사단 동원지원단
제50향토보병사단 동원지원단
제51향토보병사단 동원지원단
제52향토보병사단 동원지원단
제53향토보병사단 동원지원단
제55향토보병사단 동원지원단
제56향토보병사단 동원지원단
해병대 교육훈련단 동원지원단
인사사령부
육군사관학교 "화랑대"
육군3사관학교 "충성대"
`,
                            `근무지원단
지상정보단
정보통신단
제36향토보병사단 "백호"
제55향토보병사단 "봉화"
제3기갑여단 "번개"
제1군수지원사령부
제2군수지원사령부
제11정보통신단
제13정보통신단
제11포병단
제1107공병단
제1101공병단
제1173공병단
수도군단 "충의"
제17보병사단 "번개"
제51향토보병사단 "전승"
수도포병여단
제700특공연대
제100정보통신단
제1175공병단
제3경비단
제140정보대대
제510방공대대
제10화생방대대
제1군단 "광개토"
제1보병사단 "전진"
제9보병사단 "백마"
제25보병사단 "비룡"
제30기계화보병사단 "필승"
제2기갑여단 "충성"
제1공병여단
제1포병여단 "비호포병"
제1군수지원여단
제101정보통신단
제11방공단
제301경비연대
제701특공연대
제11화생방대대
제141정보대대
제2군단 "쌍용"
제7보병사단 "칠성"
제15보병사단 "승리"
제27보병사단 "이기자"
제2공병여단 "쌍용공병"
제2포병여단 "쌍용포병"
제2군수지원여단
제102정보통신단
제302경비연대
제702특공연대
제1전차대대
제12화생방대대
제142정보대대
제512방공대대
제3군단 "산악"
제2보병사단 "노도"
제12보병사단 "을지"
제21보병사단 "백두산"
제3공병여단
제3포병여단 "산악포병"
제3군수지원여단
제103정보통신단
제703특공연대
제303경비연대
제2전차대대
제13화생방대대
제143정보대대
제513방공대대
제5군단 "승진"
제3보병사단 "백골"
제6보병사단 "청성"
제1기갑여단 "전격"
제5공병여단
제5포병여단 "승진포병"
제5군수지원여단
제15방공단
제105정보통신단
제305경비연대
제705특공연대
제15화생방대대
제145정보대대
제6군단 "진군"
제5보병사단 "열쇠"
제28보병사단 "무적태풍"
제73동원보병사단 "충일"
제5기갑여단 "철풍"
제6공병여단
제6포병여단 "진군포병"
제106정보통신단
제306경비연대
제706특공연대
제16화생방대대
제146정보대대
제516방공대대
제7기동군단 "북진선봉"
수도기계화보병사단 "맹호"
제8기계화보병사단 "오뚜기"
제11기계화보병사단 "화랑"
제20기계화보병사단 "결전"
제7공병여단 "태극공병"
제7포병여단
제107정보통신단
제7강습대대
제17화생방대대
제517방공대대
제8군단 "동해충용"
제22보병사단 "율곡"
제23보병사단 "철벽"
제102기갑여단 "일출"
제8군수지원단 "일벌"
제12포병단
제108정보통신단
제1170공병단
제308경비연대
제8특공대대
제148정보대대
제518방공대대
제8화생방중대
`,
                            `제31향토보병사단 "충장"
제32향토보병사단 "백룡"
제35향토보병사단 "충경"
제37향토보병사단 "충용"
제39향토보병사단 "충무"
제50향토보병사단 "강철"
제53향토보병사단 "충렬"
제201특공여단
제203특공여단
제12정보통신단
제1115공병단
제1117공병단
제1118공병단
제1120공병단
제5군수지원사령부 "오성"
제19화생방대대`
                        ]
                    }
                ],
            }
        },
    }
</script>