<template>
<div>
	<el-container style="height: 800px; border: 1px solid #eee">
  <el-aside width="200px" style="background-color: rgb(238, 241, 246)">
    <el-menu :default-openeds="['1', '3']">
      <el-submenu index="1">
        <template slot="title"><i class="el-icon-message"></i>Navigator One</template>
        <el-menu-item-group>
          <el-menu-item index="1-1">Option 1</el-menu-item>
          <el-menu-item index="1-2">Option 2</el-menu-item>
        </el-menu-item-group>
      </el-submenu>
      <el-submenu index="2">
        <template slot="title"><i class="el-icon-message"></i>Navigator One</template>
        <el-menu-item-group>
          <el-menu-item index="1-1">Option 1</el-menu-item>
          <el-menu-item index="1-2">Option 2</el-menu-item>
        </el-menu-item-group>
      </el-submenu>
    </el-menu>
  </el-aside>
  
  <el-container>
    
    <el-main>
		<h1>
			{{ subjects[0].title}}
		</h1>
		<span style="white-space: pre-wrap; 
  font-family: inherit;">
			{{ subjects[ $route.params.id - 1 ].content}}
		</span>
    </el-main>
  </el-container>
</el-container>

	</div>
</template>

<script>
export default {
	
	data: function() {
    return {
		subjects: [{
        title: '화생방',
        content: `화생방(化.生.放)은 한국군에서 대량살상무기인 화학/생물학/방사능 무기를 줄여 부르는 말이다. 영어로는 CBRN(Chemical, Biological, Radiological and Nuclear weapons)이라고 하며, 예전엔 NBC(Nuclear, Biological and Chemical weapons), 그보다 이전엔 ABC(Atomic, Biological and Chemical weapons)라고 했다. 현재의 화생방을 가리키는 CBRN은 기존 개념인 NBC에 방사선을 가리키는 Radiological이 더해진 것인데, 종래의 Nuclear는 열과 폭풍효과를 기본으로 하는 전통적인 핵무기를 말하며 Radiological은 방사능 오염을 주 목적으로 하는 속칭 '더러운 폭탄'에 대응한 개념이다.

군에서 민간에 설명할 때 '후진국의 핵무기'라고 말한다. 이는 생물무기를 의미하는 것으로 애초에 높은 기술, 비용이 드는 핵무기나 위험하고 비용이 많이 드는 개별 공정을 여럿 거쳐 생산되는 화학 무기[1]에 비해 적당한 환경만 조성해 주면 번식하는 미생물을 이용한 생물학 무기가 절대적으로 비용이 싸기 때문이다.

개발에 약간의 기술력과 기간이 필요한 핵무기 개발과는 달리[2] 생물, 화학무기는 조약 때문에 대놓고 만들기가 껄끄러울 뿐이지 어느 정도의 산업기반을 지닌 수준이면 손쉽게 만들 수 있는 정도이기도 하다. 화학비료공장은 조금만 공정을 바꾸면 독가스를 생산할 수 있고 병원이나 의약품제조공장은 생물무기 배양시설로 이용될 수 있다. 한국의 비료공장+병원 수와 북한의 비료공장+병원 수만 비교해도 생산력에 엄청난 차이가 있다는 걸 알 수 있다.[3] 화생방 훈련, 즉 가스 실습은 화학 무기와 생물학 무기에 대비 하기 위한 훈련이다.

한국은 BWC, CWC 같은 금지 조약을 비준하여 더 이상의 화생방무기는 생산/보관하고 있지 않다.[4] 단 그 자체가 화생방제품의 원료로 사용되는 포스겐은 제외다. 비공식자료로 한 때 화생방무기 비축량 중 4위가 대한민국이라는 이야기가 있었다. 이 자료에서 북한은 3위, 미국은 2위, 소련은 1위였다.

한국군은 세균무기 등 생물학무기를 장비한 적은 없다. 실상 한국군은 이런 무기를 비축할 필요 자체가 없다. 세계 순위권을 다투는 한국의 공업능력이면 북한군이 비축하고 있는 화생방, 생물학 무기 수량을 찍어 누를 정도로 대량생산할 수 있다.[5] 미국은 북한군의 대량살상무기 공격에 대해 무조건적인 핵우산을 약속했기 때문에 이걸 어기지 않는 한[6] 굳이 제작할 필요가 없기도 하다.

질식/혈액/수포/신경작용제로 대표되는 화생방 무기, 탄저균, 천연두, 흑사병 등 병균이나 생물독을 사용하는 생물 무기, 핵폭탄 등의 영향을 받는 상황 등을 '화생방 상황'으로 통칭한다.

화생방 경보는 단계별로 구분되어 있다. 이를 임무형 보호태세 (MOPP, Mission Oriented Protective Posture)라고 한다. 각 단계에 따라 보호장비를 착용하며 특히 방독면은 특정 단계까지 9초 이내에 착용하는것이 교리상으로 규정되어 있다. 이는 '검사' 단계라고 불린다. 그런데 이 9초라는게 거의 마의 영역이라 숙달되지 않은 병사는 벽을 뚫기가 힘들다...라고는 하지만 어디까지나 요령의 문제로, 불가능한 수치는 아니다. 머리끈 조정이나 손의 세세한 움직임 등 유능한 교관을 만나는 것이 포인트. 문제는 현재의 논산훈련소를 비롯한 숱한 신병교육대에선 이 임무형 보호태세를 가르치는데 게을리하고 있다는 것. 이 글을 보고 있는 교관이 있다면 반성하기 바란다. 9초가 마의 영역이라고 하는데, 자대에 가서 화학대 검열나온다 하면 전원 9초 찍게 만든다. 9초를 못찍으면 그건 머리끈 조절을 잘못해서 터지기 때문이지, 방독면을 못쓰기 때문이 아니다. 이것만 한다고 MOPP를 완벽히 소화하진 못한다. 신병교육대에서 이를 소홀히 한다면 단순 반성이 아니라 국정감사를 진행해야 하는 문제다. 장갑차, 전차, 자주포가 비싸다 하는데 그 비싼 것을 하는 이유가 국민인 장병의 목숨 값이 더 비싸기 때문이다.

화생방 훈련에 숙달된 화생방대에선 최고시간 4초라는 광속을 자랑하는 병사들도 간간이 볼 수가 있어 타 부대 병사들에겐 경악의 대상으로 비춰진다. 어느 단계까지 '4초' 이내에 착용하는지에 대해서 논란의 여지가 있으나, 객관적으로 판단하자면 '닫아' 단계까지 4초 이내에 착용하는것은 불가능하다. 속칭 '가라' 로 했을때 정말 밥먹고 방독면 쓰는 연습만 한 요원이라도 '써' 단계까지가 한계일 듯. 하지만 숙달된 제독병들이라면 교리상 규정된 '검사' 단계까지 9초 이내에 끊는 것을 쉽게 볼수는 있다. 자세한 절차는 방독면 문서 참조.

육군 이외의 해군, 공군, 해병등도 교리가 같은데 화생방병을 가르치는 기관이 육군화생방학교밖에 없기 때문에 매년 육군과 협조하에 화생방 관련 주특기병들을 교육하고 있는 듯. 공군을 제외한 육해군 해병대는 육군화생방학교에서 제독 탐측 방호, 각자 부여된 특기를 교육받고 공군의 경우 진주교육사에서 기본적으로 이 3가지 기본교육을 다 받은 상태에서 자대 배치, 후에 육군 화생방대에서 파견 교육 받으라고 각 비행단에서 주기적으로 병사를 받는다. 물론 이것도 랜덤이긴 한데 주로 일병 초에서 말선 혹은 상병초까지 보낸다. 나중에 육군하고 훈련하면 화생방학교 동기인데 계급이 다른 경우를 볼 수도 있다.

화생방 공격을 받으면 다량의 사상자가 생기고 별도의 치료가 필요하며 장비, 지역, 물자를 전부 세척하여 제독해야 하기 때문에 매우 귀찮아진다. 더군다나 남한과 대치 중인 북한은 5000t 이상의 대량의 화생무기를 보유하고 있기에 한국군에는 이런 화생방 공격을 처리하기 위해 노력을 기울이는 편이다. 일반 부대에서도 화생방에 대비한 훈련을 간혹 실시하지만 제독 장비가 열악한 경우가 많이 있다. 정화를 위한 제독액에도 유통기한이 있는데 이미 효력이 보장되는 시일을 넘겨버린 경우가 부지기수다.

사단급 이상 제대에는 화생방부대가 배속되어 있는데, 비싼 장비를 사용하지만 워낙에 화생방 자체가 귀찮아서 취급은 안습한 편.(...) 또한 연대급 부대부터 참모장교로 육군화생방학교를 이수한 화생방장교작전장교의 소환수를 한 명씩 보직한다. 원래는 연대장 직속으로 소령급 참모들과 같은 라인이지만 중위~소위의 새파란 초급장교이기 때문에 보통 성격상 가장 밀접한 작전과에 자리를 주어 업무습득을 시키고, 따라서 작전장교 부사수(…) 비슷한 안습 보직이 되어 버린다.

사실 이 부분이 화생방분야 최대의 문제점으로 지적된다. 엄연히 편제되어 있는 연대, 대대급에 있는 화생방 참모(화생방장교, 화생방통제관)들은 그 분야에 있어선 소속 제대의 최대 전문가임에도 불구하고 그 분야에 대해 임하는 업무 자체가 내려지지도 않을뿐더러 간섭도 하지 않는다. 부대의 규정을 찾아보면, '화생방'관련 업무가 빼곡함에도 불구하고 이런 사태가 벌어지는 이유는, 부대 자체가 화생방 업무를 있어도 그만, 없어도 그만으로 간주하기 때문. 왜 이런 자연스런 직무유기가 이뤄지는가 하면 명령을 내리고 지시를 내려야 할 상급자 자체가 화생방분야에 대해 거의 완벽하다 할 정도로 무지하기 때문이다.

실제 화생방 분야는 화생방 작전, 장비학, 병기본과 관련 치장물자 관리 등 머리가 아플 정도로 복잡하다. 각 분야는 조각조각 나뉘어져 '비전문가'인 작전과, 군수과, 인사과 등에 뿌려져 있으나, 본인 업무에 치중하기에도 바쁜 와중에 지독스럽게 방대한 '화생방 분야'를 따로 떼어 놓고 공부할 여유는 없다. 제대에 화생방 참모가 따로 필요한 이유가 그것이다.

그런데 온 국군의 수많은 화생방 참모가 본인의 임무가 유기된 채 그저 계급높은 '계원1'처럼 부려지고 있다. 무슨 일을 시켜야 할 지 모른다는 이유에서! 말하자면 RPG게임에서 힐러를 파티에 초대해 놨더니 공대장이 '힐러가 뭐지? 에라 모르겠다. 저기가서 몹이나 때려잡아.'하면서 몽둥이를 쥐어주는 셈이다. 무능의 극치가 아닐 수 없다.

이런 대우를 함에도 전혀 문제없이 군부대들이 흘러가는 이유는 전시상황이 아닐 경우에는 딱히 이 화생방 참모의 중요성이 부각될 일이 없기 때문이다. 있어도 그만, 없어도 그만인 이 상황에 화생방 분야에 힘을 집중할 필요가 있을까? 그럴 바에야 작전과 업무를 떠넘기고 일손을 줄이는 편이 속편하다. 또한 하급부대에서 상급부대에 이르기까지 검열에 힘쏟아야 할 주체들이 화생방 분야에 무지한 이들이 줄줄이 뿌리깊게 뻗어있고 이 분야를 강조할 화생방병과의 숫자는 안습할 정도로 적고, 계급이 낮다. 당장에 직면한 훈련들이 한 두개가 아닌데 성가신 화생방 분야에 까지 신경써야 하는가..대다수의 주요직위자들이 이정도 수준에 머물러 있는것이 문제.

만일 현재의 한국 군부대의 화생방 훈련 수준에서 북한의 화학, 생물학, 핵공격을 얻어 맞았을 경우, 참혹한 꼴을 면하지 못한 채 나뒹굴 가능성이 매우 높다.

연대급 작전과에 보직되는 작전장교는 중대장 다 마친 고참 대위, 작전과장도 중령 진급 들어갈 때쯤 된 소령이기 때문에 화생방장교는 들어오는 순간부터 전역할 때까지 까마득한 막내. 중위가 되고 시간이 좀 지나도 헛기침 한 번 해 보기 힘든데 작전 업무도 도맡아 하는 좀 불쌍한 보직이다. 그러나 작전장교 업무를 나눠서 하는 것이나 다름없기 때문에 업무습득을 잘 해 놓으면 연대 직할 중대들이나 대대 같은 예하 부대들에 꽤 영향력을 행사할 수도 있다.

대한민국 국군에서는 화생방 상황 시 방어를 전담하기 위해 창설된 국직부대도 있다. 서울시 외곽에 위치한 국군화생방방호사령부가 그것.

병사들이 화생방 훈련의 하위 훈련인 가스실습을 화생방이라고 부르기도 한다. 가스실습을 화생방 교장에서 하므로 그렇게 부르게 된 듯.

참고로, 미국의 전시 화생방전 수칙은 다음과 같다.
화생방 무기는 선빵으로 쓰지 않는다.
생물학 무기는 절대로 쓰지 않는다.
방사능 무기(=핵무기)는 최후의 수단으로 사용한다.
`,
      }, {
        title: '화생방',
        project: 'Project B',
      }, {
        title: '정신전력',
        project: 'Project C',
      }, {
        title: '군부대',
        project: 'Project D',
      }],
    }
  },
}
</script>
